REGULAR:
GNU gdb (Ubuntu 8.2-0ubuntu1~18.04) 8.2
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ExploreTheRegularLabyrinth.exe...done.
(gdb) b ExploreTheRegularLabyrinth.cpp:17
Breakpoint 1 at 0x1da1: file ExploreTheRegularLabyrinth.cpp, line 19.
(gdb) r
Starting program: /home/ronak/cs_251_troy_spring_2022/project_4__labyrinth_escape_ii/ExploreTheRegularLabyrinth.exe

Breakpoint 1, main () at ExploreTheRegularLabyrinth.cpp:19
19      if (isPathToFreedom(start, kPathOutOfRegularMaze)) {
(gdb) i locals
m = {_vptr.Maze = 0x555555763bf8 <vtable for Maze+16>, grid = {
    _vptr.Grid = 0x555555763c18 <vtable for Grid<MazeCell*>+16>, NumRows = 4,
    Rows = 0x555555776f10}, numRows = 4, numCols = 4, kNumTwistyRooms = 12}
start = 0x555555777370
(gdb) p *start
$1 = {whatsHere = "", north = 0x0, south = 0x5555557774b0, east = 0x0, west = 0x0}
(gdb) p *(start->south)
$2 = {whatsHere = "", north = 0x555555777370, south = 0x5555557775f0, east = 0x555555777500,
  west = 0x0}
(gdb) p *(start->south->south)
$3 = {whatsHere = "", north = 0x5555557774b0, south = 0x555555777730, east = 0x0, west = 0x0}
(gdb) p *(start->south->east)
$4 = {whatsHere = "", north = 0x0, south = 0x555555777640, east = 0x555555777550, west = 0x5555557774b0}
(gdb) p *(start->south->east->east)
$5 = {whatsHere = "", north = 0x555555777410, south = 0x555555777690, east = 0x5555557775a0,
  west = 0x555555777500}
(gdb) p *(start->south->east->south)
$6 = {whatsHere = "", north = 0x555555777500, south = 0x0, east = 0x0, west = 0x0}
(gdb) p *(start->south->east->->east->north)
A syntax error in expression, near `->east->north)'.
(gdb) p *(start->south->east->east->north)
$7 = {whatsHere = "", north = 0x0, south = 0x555555777550, east = 0x555555777460, west = 0x5555557773c0}
(gdb) p *(start->south->east->east->east)
$8 = {whatsHere = "", north = 0x0, south = 0x5555557776e0, east = 0x0, west = 0x555555777550}
(gdb) p *(start->south->east->east->north->west)
$9 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555777410, west = 0x0}
(gdb) p *(start->south->east->east->north->east
A syntax error in expression, near `'.
(gdb) p *(start->south->east->east->north->east)
$10 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x0, west = 0x555555777410}
(gdb) p *(start->south->east->east->east->south)
$11 = {whatsHere = "", north = 0x5555557775a0, south = 0x555555777820, east = 0x0, west = 0x0}
(gdb) p *(start->south->east->east->east->south->south)
$12 = {whatsHere = "Wand", north = 0x5555557776e0, south = 0x0, east = 0x0, west = 0x0}
(gdb) p *(start->south->south->south)
$13 = {whatsHere = "Spellbook", north = 0x5555557775f0, south = 0x0, east = 0x0, west = 0x0}
(gdb) p *(start->south->east->east->south)
$14 = {whatsHere = "", north = 0x555555777550, south = 0x5555557777d0, east = 0x0, west = 0x0}
(gdb) p *(start->south->east->east->south->south)
$15 = {whatsHere = "", north = 0x555555777690, south = 0x0, east = 0x0, west = 0x555555777780}
(gdb) Quit
(gdb) p *(start->south->east->east->south->south->west)
$16 = {whatsHere = "Potion", north = 0x0, south = 0x0, east = 0x5555557777d0, west = 0x0}

------------------------------------------------------------------------------
TWISTY:
GNU gdb (Ubuntu 8.2-0ubuntu1~18.04) 8.2
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ExploreTheTwistyLabyrinth.exe...done.
(gdb) b ExploreTheTwistyLabyrinth.cpp:18
Breakpoint 1 at 0x1d1c: file ExploreTheTwistyLabyrinth.cpp, line 20.
(gdb) r
Starting program: /home/ronak/cs_251_troy_spring_2022/project_4__labyrinth_escape_ii/ExploreTheTwistyLabyrinth.exe

Breakpoint 1, main () at ExploreTheTwistyLabyrinth.cpp:20
20      if (isPathToFreedom(start, kPathOutOfTwistyMaze)) {
(gdb) i locals
m = {_vptr.Maze = 0x555555764bf0 <vtable for Maze+16>, grid = {
    _vptr.Grid = 0x555555764c10 <vtable for Grid<MazeCell*>+16>, NumRows = 4,
    Rows = 0x555555777ee0}, numRows = 4, numCols = 4, kNumTwistyRooms = 12}
start = 0x555555778840
(gdb) p *start
$1 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555778a70, west = 0x555555778b10}
(gdb) p *(start->east)
$2 = {whatsHere = "", north = 0x555555778840, south = 0x555555778930, east = 0x0, west = 0x0}
(gdb) p *(start->east->south)
$3 = {whatsHere = "", north = 0x0, south = 0x555555778ac0, east = 0x555555778a70, west = 0x0}
(gdb) p *(start->east->south->south)
$4 = {whatsHere = "", north = 0x555555778930, south = 0x555555778980, east = 0x555555778bf0,
  west = 0x0}
(gdb) p *(start->east->south->south->south)
$5 = {whatsHere = "", north = 0x555555778890, south = 0x555555778ac0, east = 0x5555557788e0,
  west = 0x0}
(gdb) p *(start->east->south->south->south->south)
$6 = {whatsHere = "", north = 0x555555778930, south = 0x555555778980, east = 0x555555778bf0,
  west = 0x0}
(gdb) p *(start->east->south->south->east)
$7 = {whatsHere = "Wand", north = 0x555555778ac0, south = 0x0, east = 0x0, west = 0x555555778c40}
(gdb) p *(start->east->south->south->east->west)
$8 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555778bf0, west = 0x5555557788e0}
(gdb) p *(start->east->south->south->east->west->west)
$9 = {whatsHere = "", north = 0x0, south = 0x555555778c40, east = 0x555555778980, west = 0x555555778890}
(gdb) p *(start->east->south->south->east->west->west->west)
$10 = {whatsHere = "Spellbook", north = 0x5555557788e0, south = 0x0, east = 0x0, west = 0x555555778980}
(gdb) p *(start->west)
$11 = {whatsHere = "", north = 0x555555778840, south = 0x0, east = 0x555555778a20, west = 0x5555557789d0}
(gdb) p *(start->west->east)
$12 = {whatsHere = "Potion", north = 0x0, south = 0x0, east = 0x555555778b10, west = 0x5555557789d0}
(gdb)